app/controllers/accounts_controller.rb

  def create
    @account = Account.new(params[:account])
    if @account.save
---
INSERT INTO `accounts` (`company`, `contact`, `created_at`, `email`, `firstname`, `lastname`, `password`, `teamsize`, `updated_at`, `webaddress`) VALUES ('FixNix', 8122302366, '2014-04-03 05:28:37', 'sriharsha.kappala@hotmail.com', 'Sri Harsha', 'Kappala', 'abcdef', 2, '2014-04-03 05:28:37', 'abcdef')